Table of Contents
 Class BendData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of bend
public class BendData
Inheritance
object
BendData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 EndFaceNormal1
End Face Normal vector
public Vector3D EndFaceNormal1 { get; set; }
Property Value
Vector3D
 Plate1Id
First plate
public int Plate1Id { get; set; }
Property Value
int
 Plate2Id
Second plate
public int Plate2Id { get; set; }
Property Value
int
 Point1OfSideBoundary1
Side boundary first plate point 1
public Point3D Point1OfSideBoundary1 { get; set; }
Property Value
Point3D
 Point1OfSideBoundary2
Side boundary second plate point 1
public Point3D Point1OfSideBoundary2 { get; set; }
Property Value
Point3D
 Point2OfSideBoundary1
Side boundary first plate point 2
public Point3D Point2OfSideBoundary1 { get; set; }
Property Value
Point3D
 Point2OfSideBoundary2
Side boundary second plate point 2
public Point3D Point2OfSideBoundary2 { get; set; }
Property Value
Point3D
 Radius
Radius of bend
public double Radius { get; set; }
Property Value
double
 Edit this page